In [1]:
import datetime
import time

import pandas as pd
import seaborn as sns
import cartopy.crs as ccrs
import cartopy.feature as cfeature
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
import pgpasslib

from querymsc import WorkflowTools
%load_ext autoreload
%autoreload 2

In [2]:
connection_string = "postgresql+psycopg2://nannau@dbmsc.pcic.uvic.ca/msc"
engine = create_engine(connection_string)
Session = sessionmaker(bind=engine)
session = Session()

In [3]:
start_time = datetime.datetime(1990, 1, 1)
end_time = datetime.datetime(1991, 1, 1)

msc = WorkflowTools(start_time, end_time)

1.0 31.0 744.0

In [10]:
annual_tot_precip = msc.query_annual_precip(session)
annual_tot_rain = msc.query_annual_rain(session)
query_temp = msc.query_design_temp_percentile(session)

In [11]:
query = msc.query_design_temp_percentile(session)

In [15]:
annual_tot_precip = msc.query_annual_precip(session)
pd.read_sql(annual_tot_precip.statement, engine).head()

,annual_precip,time_min,time_max,lat,lon,station_id,obs_count,completeness
0,1052.0,1990-01-01,1990-12-31,41.7833,-82.6833,6063,365,1.0
1,1159.7,1990-01-01,1990-12-31,41.9500,-82.5167,6140,365,1.0
2,1061.4,1990-01-01,1990-12-31,42.0333,-82.9000,6036,365,1.0
3,1144.4,1990-01-01,1990-12-31,42.0431,-82.6739,6040,365,1.0
4,1189.5,1990-01-01,1990-12-31,42.1034,-83.0945,5992,365,1.0

In [16]:
annual_tot_rain = msc.query_annual_rain(session)
pd.read_sql(annual_tot_rain.statement, engine).head()

,annual_rain,time_min,time_max,lat,lon,station_id,obs_count,completeness
0,1013.6,1990-01-01,1990-12-31,41.7833,-82.6833,6063,365,1.0
1,1102.7,1990-01-01,1990-12-31,41.9500,-82.5167,6140,365,1.0
2,990.4,1990-01-01,1990-12-31,42.0333,-82.9000,6036,365,1.0
3,1094.2,1990-01-01,1990-12-31,42.0431,-82.6739,6040,365,1.0
4,1097.7,1990-01-01,1990-12-31,42.1034,-83.0945,5992,365,1.0

In [17]:
query_temp = msc.query_design_temp_percentile(session)
pd.read_sql(query_temp.statement, engine).head()

,air_temperature,time_min,time_max,lat,lon,station_id,completeness
0,-6.000,1990-01-01,1990-01-31,41.7833,-82.6833,6063,0.903226
1,-9.210,1990-01-01,1990-01-31,41.9500,-82.5167,6140,0.967742
2,-9.500,1990-01-01,1990-01-31,42.0333,-82.9000,6036,1.000000
3,-11.550,1990-01-01,1990-01-31,42.0431,-82.6739,6040,0.967742
4,-7.325,1990-01-01,1990-01-31,42.1034,-83.0945,5992,0.903226

In [20]:
query_design_temp_dry = msc.query_design_temp_dry(session, month=7)
pd.read_sql(query_design_temp_dry.statement, engine).head()

,wet_bulb_temperature,time_min,time_max,lat,lon,station_id,completeness,obs_count
0,19.875,1990-07-01,1990-07-31,41.7833,-82.6833,6063,1.000000,31
1,19.375,1990-07-01,1990-07-31,41.9500,-82.5167,6140,1.000000,31
2,18.750,1990-07-01,1990-07-31,42.0333,-82.9000,6036,1.000000,31
3,19.000,1990-07-01,1990-07-31,42.0431,-82.6739,6040,0.967742,30
4,20.250,1990-07-01,1990-07-31,42.1034,-83.0945,5992,1.000000,31

In [21]:
query_design_temp_wet = msc.query_design_temp_wet(session, month=7)
pd.read_sql(query_design_temp_wet.statement, engine)

NameError: name 'total_days' is not defined

In [32]:
pd.read_sql(annual_tot_rain.statement, engine).head()

Empty DataFrame
Columns: [annual_rain, min_date, max_date, completeness, lat, lon, station_id]
Index: []

In [21]:
df_vars = pd.read_sql(msc.query_variables(session).statement, engine)
#df_vars[df_vars['net_var_name']=='127']
#df_vars[(df_vars['net_var_name'].astype(int) > 124) & (df_vars['net_var_name'].astype(int) < 132)]
df_vars[df_vars['standard_name'].str.contains('temperature')]

,vars_id,standard_name,long_description,unit,cell_method,net_var_name
5,1294,dew_point_temperature,Dew point temperature,0.1 Celsius,time: point,74
9,1299,air_temperature,AKA Dry Bulb Temperature,0.1 Celsius,,78
10,1300,wet_bulb_temperature,Wet bulb temperature,0.1 Celsius,,79
103,1392,air_temperature,Daily max temperature,0.1 Celsius,time: maximum,1
104,1393,air_temperature,Daily min temperature,0.1 Celsius,time: minimum,2
105,1394,air_temperature,Daily mean temperature,0.1 Celsius,time: mean,3
142,1444,air_temperature,Mean max temperature,0.1 Celsius,time: mean,40
143,1445,air_temperature,Mean min temperature,0.1 Celsius,time: mean,41
144,1446,air_temperature,Mean monthly temperature,0.1 Celsius,time: mean,42
145,1447,air_temperature_anomaly,Mean monthly temperature difference from normal,0.1 Celsius,,43
146,1448,air_temperature,Extreme max temperature,0.1 Celsius,time: maximum,44
148,1450,air_temperature,Extreme min temperature,0.1 Celsius,time: minimum,46
184,1486,soil_temperature,AM soil temperature at 1 cm,0.1 Celsius,time: point,134
185,1487,soil_temperature,AM soil temperature at 5 cm,0.1 Celsius,time: point,135
186,1488,soil_temperature,AM soil temperature at 10 cm,0.1 Celsius,time: point,136
187,1489,soil_temperature,AM soil temperature at 20 cm,0.1 Celsius,time: point,137
188,1490,soil_temperature,AM soil temperature at 50 cm,0.1 Celsius,time: point,138
189,1491,soil_temperature,AM soil temperature at 100 cm,0.1 Celsius,time: point,139
190,1492,soil_temperature,AM soil temperature at 150 cm,0.1 Celsius,time: point,140
191,1493,soil_temperature,AM soil temperature at 300 cm,0.1 Celsius,time: point,141
193,1495,soil_temperature,PM Soil temperatures at 1cm,0.1 Celsius,time: point,143
194,1496,soil_temperature,PM Soil temperatures at 5 cm,0.1 Celsius,time: point,144
195,1497,soil_temperature,PM Soil temperatures at 10 cm,0.1 Celsius,time: point,145
196,1498,soil_temperature,PM Soil temperatures at 20 cm,0.1 Celsius,time: point,146
197,1499,soil_temperature,PM Soil temperatures at 50 cm,0.1 Celsius,time: point,147
198,1500,soil_temperature,PM Soil temperatures at 100 cm,0.1 Celsius,time: point,148
199,1501,soil_temperature,PM Soil temperatures at 150 cm,0.1 Celsius,time: point,149
204,1509,sea_water_temperature,Water temperature,0.1 Celsius,time: point,153
205,1510,air_temperature,Air temperature,0.1 Celsius,time: point,154